; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v1)
		(pred_1 ?v6)
		(pred_5 ?v4)
		(pred_3 ?v4)
		(pred_4 ?v6 ?v4)
		(pred_6)
		(pred_2 ?v6))

   (:action op_1
       :parameters  (?v8 ?v5)
       :precondition (and (not-eq ?v8 ?v5) 
                          (pred_5 ?v8) (pred_5 ?v5) (pred_3 ?v8))
       :effect (and  (pred_3 ?v5)
		     (not (pred_3 ?v8))))


   (:action op_3
       :parameters (?v7 ?v3)
       :precondition  (and  (pred_1 ?v7) (pred_5 ?v3)
			    (pred_4 ?v7 ?v3) (pred_3 ?v3) (pred_6))
       :effect (and (pred_2 ?v7)
		    (not (pred_4 ?v7 ?v3)) 
		    (not (pred_6))))

   (:action op_2
       :parameters  (?v7  ?v3)
       :precondition  (and  (pred_1 ?v7) (pred_5 ?v3)
			    (pred_2 ?v7) (pred_3 ?v3))
       :effect (and (pred_4 ?v7 ?v3)
		    (pred_6)
		    (not (pred_2 ?v7)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_05 obj_04 obj_01 
          obj_06 obj_03 obj_02 
)
(:init
(pred_5 obj_05)
(pred_5 obj_04)
(pred_5 obj_01)
(pred_1 obj_06)
(pred_1 obj_03)
(pred_1 obj_02)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(pred_6)
(pred_4 obj_06 obj_04)
(pred_4 obj_03 obj_01)
(pred_4 obj_02 obj_04)
(pred_3 obj_04)
)
(:goal
(and
(pred_4 obj_06 obj_04)
(pred_4 obj_03 obj_05)
(pred_4 obj_02 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_03 obj_05) (pred_3 obj_04))
    (sometime-before  (pred_4 obj_02 obj_01) (pred_3 obj_05))
  )
)
)

; plan
1. (op_3 obj_02 obj_04)
   deleted: (pred_4 obj_02 obj_04) (pred_6)
   added: (pred_2 obj_02)
   goals met: 1 of 3
2. (op_1 obj_04 obj_01)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_01)
   goals met: 1 of 3
3. (op_1 obj_01 obj_05)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_05)
   goals met: 1 of 3
4. (op_2 obj_02 obj_05)
   deleted: (pred_2 obj_02)
   added: (pred_4 obj_02 obj_05) (pred_6)
   goals met: 1 of 3
5. (op_1 obj_05 obj_01)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_01)
   goals met: 1 of 3
6. (op_3 obj_03 obj_01)
   deleted: (pred_4 obj_03 obj_01) (pred_6)
   added: (pred_2 obj_03)
   goals met: 1 of 3
7. (op_1 obj_01 obj_05)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_05)
   goals met: 1 of 3
8. (op_2 obj_03 obj_05)
   deleted: (pred_2 obj_03)
   added: (pred_4 obj_03 obj_05) (pred_6)
   goals met: 2 of 3
9. (op_3 obj_02 obj_05)
   deleted: (pred_4 obj_02 obj_05) (pred_6)
   added: (pred_2 obj_02)
   goals met: 2 of 3
10. (op_1 obj_05 obj_01)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_01)
   goals met: 2 of 3
11. (op_2 obj_02 obj_01)
   deleted: (pred_2 obj_02)
   added: (pred_4 obj_02 obj_01) (pred_6)
   goals met: 3 of 3
